#include <stdio.h>

int main(int argc, char const *argv[])
{
    //假设有一个无符号32位整型数据
    unsigned int data=0x12ff0045;     // 0001 0010 1111 1111 0000 0000 0100 0101
                                             //    00        11
    // 请编写一个程序用位运算把data的第14、15位修改1，把22、23位修改为0， 并且输出修改后的数据。
    //                                                         要求两个位同时修改

    data = (3 << 14) | data;         //0001 0010 1111 1111 1100 0000 0100 0101   0x12FFC045
    printf("把data的第14、15位修改1值为：%#x\n",data);

    data = (~(3 << 22)) & data;      //0001 0010 0011 1111 1100 0000 0100 0101   0x123FC045
    printf("把data的第22、23位修改0值为：%#x\n",data);
    return 0;
}
